{
    "Text": [
        {
            "page": "General Tips",
            "desc": "These are more general tips I have for school and life in general."
        }
    ],
    "GeneralTips": [
        {
            "id": 1,
            "underlined": "Just get started",
            "tip": "No matter what I'm working on, it always seems like the hardest part of it is getting started. I find that I sometimes procrastinate when I find a task daunting or think it will be challenging. It's never as bad it seems once you get started and get into the flow of things. Just try your best to start working on what you find difficult and it's usually not nearly as hard as you think it will be. Relevant [Mark Goatberg](https://www.tiktok.com/t/ZTNuhvS4E/) clip."
        },
        {
            "id": 2,
            "underlined": "The 5 second rule",
            "tip": "This is kind of adding the first point, learn the 5 second rule. Whenever you have something to do and are procrastinating, don't just sit there and ponder about it. Start counting down from 5 and when you get to 1, make a decision about what you're going to do. For example, say I've been scrolling on Instagram for a while and have work to do. I'd start counting down from 5 and once I get to 1 I'll decide if I should keep scrolling or go do something more productive. It works basically everytime."
        },
        {
            "id": 3,
            "underlined": "Check out UNCW Hiking trails",
            "tip": "The beauty of UNCW's campus is extremely underrated imo. App State and UNC tend to get all the attention. However, UNCW has some really nice, very big hiking trails I used to walk somewhat frequently. It's a great way to get exercise and unwind at the same time. I also think it'd be a fun activity to do with your friends. The trails I'm referring to are behind Seahawk Landing, though I'd typically start at a different point."
        },
        {
            "id": 4,
            "underlined": "Send in your high school AP scores",
            "tip": "If you haven't done so already, I'd recommend sending in your high school AP scores. They can get you college credit which can be beneficial for many reasons. The credit can help you graduate early, get out of classes you don't want to take, give you more time to take classes you do want to take, etc."
        },
        {
            "id": 5,
            "underlined": "Get an internship",
            "tip": "Internships are a great way to develop skills and gain experience. It also looks good to future employers who are looking for someone with past experience."
        },
        {
            "id": 6,
            "underlined": "Imposter syndrome is normal",
            "tip": "It's normal to think that everyone knows more than you, or is more experienced than you. Don't be afraid to ask for help or feel lesser of yourself. People will typically be happy to help you learn."
        },
        {
            "id": 7,
            "underlined": "Keep up to date with you emails",
            "tip": "Sometimes emails contain important information that requires your attention. I'd recommend checking and cleaning your emails consistently to keep up with important info."
        },
        {
            "id": 8,
            "underlined": "Buy a cable adapter",
            "tip": "Whenever I had to give a presentation in college it always seemed like people were missing a cable to hookup their computer to the smartboard. I think cable adapters are a great thing to have to charge multiple devices at once, hookup to smartboard, etc. I'd recommend buying this [one](https://www.amazon.com/CableCreation-Multiport-Adapter-Ethernet-MacBook/dp/B0967WZBGZ/ref=sr_1_3?crid=2DSU62TGAGHU2&dib=eyJ2IjoiMSJ9.mydca7xUkG-uDUmqlIqEKf5-eykgN8B32RHE6zvffSt-n1Q1gsxNRMSLWmXX0tIwuqs4wyFMltMvUkR3it6uOjnS-JBWkqKCP9M9-jYrye4DXLdae1lOZdVROJBCtmm_qSulrcia_8JITKkL4Ha_2quxrv_Tq9tQWlcO8TgUyC63s8XKYUUv_NlYG1snGL8Zv5kBP1a9cetXYrXkd-o4Jokn-QfaK8V1IgoRMsqIz20.bP7YdhW1HPf8-tPns14lH5EMgx7B2qYNSWTyxitpPXs&dib_tag=se&keywords=cablecreation&qid=1713744859&sprefix=CableCreat%2Caps%2C106&sr=8-3&th=1) that you can buy from your older brothers company Amazon. It's a little pricey but definitely worth it imo. Just make sure to buy one that actually works for your computer."
        },
        {
            "id": 9,
            "underlined": "Keep above 3.5 GPA or above",
            "tip": "Your GPA doesn't have to be perfect, but companies usually ask what your GPA is using ranges. The top range is usually 3.5 and above, so try to maintain that."
        },
        {
            "id": 10,
            "underlined": "Take 21 credit hours",
            "tip": "Obviously if you think this would be too heavy a workload, you don't have to take this many credit hours. However if you want to graduate early taking 21 credits in a semester might help you. I did this a couple times in college and it allowed to me graduate a semester early. Contact your counselor for an override."
        },
        {
            "id": 11,
            "underlined": "Buy your diploma frame from the UNCW bookstore",
            "tip": "The bookstore sells diploma frames. When you graduate it's a good place to look since they have the right sizes."
        },
        {
            "id": 12,
            "underlined": "Have a .txt file on your computer paste information",
            "tip": "Having a single text file you can temporarily put information in has been useful in my experience. You can shrink it and quickly copy, paste, and delete info while you're working. You can have it open right beside whatever you're working on."
        },
        {
            "id": 13,
            "underlined": "Network and meet people at your job",
            "tip": "Networking is a great way to meet new people and gain new opportunities."
        },
        {
            "id": 14,
            "underlined": "Try Greyhound buses",
            "tip": "This is a relatively affordable way to get from Wilmington to Charlotte if you don't have a car."
        },
        {
            "id": 15,
            "underlined": "Follow Lil Goof Ball on TikTok",
            "tip": "This guy went to UNCW and I think his TikTok is pretty funny. You can follow him [here](https://www.tiktok.com/@lilgoofball). Also, he's on campus pretty frequently, so keep an eye out for him if you want."
        },
        {
            "id": 16,
            "underlined": "Break tasks into smaller parts",
            "tip": "Finishing one task at a time can help keep you focused and organized on what you're working on."
        },
        {
            "id": 17,
            "underlined": "Make your Resume aesthetically pleasing",
            "tip": "Having a well-organized and professional looking resume can help you stand out to employers. I've gotten a couple compliments on my resume from recruiters before. See this (page)[/Jobs/ResumeTemplate] for the template I use."
        },
        {
            "id": 18,
            "underlined": "It's not too late to change major, or add a minor",
            "tip": "If you wanted to switch to computer science, or add a CS as a minor it's not too late. I outlined classes you be taking in this [page](/Classes/CompSciMinor). If you switched you could also use some of the classes you've probably already taken for a business concentration/minor."
        },
        {
            "id": 19,
            "underlined": "Join Clubs",
            "tip": "College clubs are great way to meet people with similar interests as you."
        },
        {
            "id": 20,
            "underlined": "Know how to present a powerpoint project with notes on zoom",
            "tip": "To share your presentation on zoom without showing your audience the presenters notes watch this [video](https://youtu.be/yu7FIk7FFbc?si=48gBQpFlmVa314q2). First open your powerpoint presentation, then on the right-side of the bottom bar, click on the icon that says \"Slide Show\" when hovered over and click on it. Then in the lower left-hand side click on the icon with three dots, in the pop up menu select \"Use Presenter View\". Now go back to zoom using control + up arrow (if you’re on mac). When you're back on zoom click \"Share\" and select the screen that says \"Microsoft PowerPoint - PowerPoint Slide Show\" or something similar when hovered over. Then click \"Share\", you should be good now."
        }
    ]
}