{
    "Text": [
        {
            "page": "Memes",
            "desc": "Computer Science Memes"
        }
    ],
    "Memes": [
        { 
            "text": "Like half my professors in college",
            "transcription": "Teacher: copy these notes carefully they will be on the test Literally 5 seconds later:"
        },
        { 
            "text": "How would I manage?",
            "transcription": "U get $200 Million but u can't use Google Books for 3 Days Would u do it?? google.com Google news maps books perspectives fligh sign in"
        },
        { 
            "text": "Don't do that, Don't give me hope",
            "transcription": "When someone suggests Hurricane Fred finna cancel school Don't do that. Don't give me hope."
        },
        { 
            "text": "Extremely true",
            "transcription": "8 hours writing a personal project in assembly at 1am 1 hour of writing javascript at 2pm for my job that pays me"
        },
        { 
            "text": "CSC 231 professors: *heavy breathing*",
            "transcription": "The Dutch government was forced to release the source code of their DigiD digital authentication iOS app. It is written in C#. Ahh I see the problem is that there are too many if statements. Here's a solution implementing binary search in O(log n). Jeroen Frijters @JeroenFrijters 1d github.com/MinBZK/woo-bes... tyrannoSaurav @TyrannoSaurav Replying to @JeroenFrijters"
        },
        { 
            "text": "I feel like this sometimes",
            "transcription": "Born to be a viking in 732 ad Forced to live in 2024"
        },
        { 
            "text": "Testing ain't it bro 😭",
            "transcription": "Write code write tests the tests fail the tests fail write more tests to narrow down the problem Those tests pass The bug was in the test ProgrammerHumor.io"
        },
        { 
            "text": "I'm too American to understand this.",
            "transcription": "So what's your idea of a perfect date? DD/MM/YYYY I find other formats a bit confusing. Pun hub IG: PunHubOnline"
        },
        { 
            "text": "!anIdealSituation",
            "transcription": "POV: Me showing up to my final exam (I need a 124% to pass)"
        },
        { 
            "text": "\"FileNotFoundException\"",
            "transcription": "Backenders doing frontend menu 1 - Reports 2 - Charts 3 - Exit Select: [_] Frontenders doing backend internal server error 500"
        },
        {
            "text": "*Because there was a hurricane",
            "transcription": "winter break is extended bc the school exploded."
        },
        { 
            "text": "Goated feeling",
            "transcription": "How it feels to exit you final period on a cloudy Friday before winter break"
        },
        { 
            "text": "They're definitely talking about me.",
            "transcription": "What's with all these muscled up guys in CS classes I am an accounting major where all the guys are weak with tiny noodles arms and girls have staches. Last week I was walking outside a compsci classroom I saw the class was full of incredibly muscled guys. They were so ripped that even the dumbbells seemed to blush in their presence. These guys had biceps that could make Hercules jealous and abs that looked like they were chiseled by Michelangelo himself. What gives? r/csMajors u/Boring_Inspector9857 • 7h 440 59 share Join"
        },
        { 
            "text": "High CPU usage 😍",
            "transcription": "I wrote a while(true) loop With break statements right?"
        }, 
        { 
            "text": "Lowkey everything's basically a txt file in programming.",
            "transcription": "database.sql database.xlsx database.txt"
        },
        { 
            "text": "Highlight + command + / goes so hard",
            "transcription": "comments to describe the program comments to temporarily remove part of code"
        },
        {
            "text": "\"UNCWAlert: Campus Operations Affected by Expected Tropical Weather Conditions.\"",
            "transcription": "Oh my god oh my YES YES YES YES YES oh oh oh my god. Npesta screaming yes."
        },
        { 
            "text": "I feel like some companies actually do this.",
            "transcription": "Hey! what's going on? Sick bastard! // brute-force attack protection if isPasswordCorrect && isFirstLoginAttempt { Error(\"Wrong login or password\") } "
        },
        { 
            "text": "Anything to make it work.",
            "transcription": "I'm a Pull Stack Developer. I just pull things off the internet and put it into my code. 5:13 AM 19 Dec 20 Twitter for Android 647 Retweets 122 Quote Tweets 5,154 Likes"
        },
        { 
            "text": "The sheer...verbosity of it all 😳🤯",
            "transcription": "Python Hello World Java Public Static void Hello World"
        },
        { 
            "text": "CSC 351 gang",
            "transcription": "HTTP status ranges in a nutshell 1xx: hold on 2xx: here you go 3xx: go away 4xx: you fucked up 5xx: I fucked up"
        },
        { 
            "text": "*0.00004 seconds faster",
            "transcription": "C++ devs when their thousand line code is .4 seconds faster than a 10 line python code I am speed"
        },
        { 
            "text": "When your \"Hello World\" program runs.",
            "transcription": "Lets be clear I'm literally the smartest programmer that has ever lived ok. Terry Davis"
        },
        { 
            "text": "Fidelity Investments be like",
            "transcription": "Unc, Duke, and Ncsu students RTP employers Uncw RTP employers"
        },
        { 
            "text": "Why can't it feel like that at night 😫",
            "transcription": "My bed when I have to wake up for class We're hitting comfort levels that shouldn't even be possible"
        },
        { 
            "text": "Cisco Webex ftw",
            "transcription": "Some Famous Severs Amazon Google Microsoft Zoom app"
        },
        { 
            "text": "Average computer science graduate reaction",
            "transcription": "Watching the homeless man pull of a knife Watching the homeless man pull out your same degree Ronaldo"
        },
        { 
            "text": "*Dies of suffocation*",
            "transcription": "When I'm in a being crowded competition and my opponent is Shore on Saturday Morning"
        },
        { 
            "text": "The hardest part about React",
            "transcription": "That's right, I use React R I can't E Setup A Node Environment C Help T"
        },
        { 
            "text": "This happens at least once whenever I try to create a slideshow.",
            "transcription": "I'm a PNG. You can download me. And you're transparent, right? e transparent, right?"
        },
        { 
            "text": "CSC 342 gang",
            "transcription": "She bit me 8 times Liar! It's just 1 byte"
        },
        { 
            "text": "Computer fan noise goes hard.",
            "transcription": "We are going to freeze to death if we don't do something We only have on option left Run Android Studio"
        },
        { 
            "text": "Applying to jobs be like",
            "transcription": "Noooooooooooo I don't wanna sign up with facebook sign up with google Name First Name Last Name Pick a username create a password Confirm password Data of birth select month Gender select gender zip code Sign In with Google Sign in with Facebook Sign in with Twitter Sign in with email Sign in with phone Please login to continue Password access create your account Sign up with Email Confirm your email address please click on the link below to confirm your email address Confirm your email Please note: the link will expire in 15 minutes."
        },
        { 
            "text": "This needs to be a real language",
            "transcription": "As a way to encourage the younger generation to try out programming most of the key words in C# have been permanently renamed. This should increase the amount of younger game developers coming the next few years. default public float rizz; private bool IsSus() try if(rizz > vibe) return true; else return false; catch(Exception e) Debug.LogError(e.Message); throw; gen z highkey period rizz; lowkey fax IsSus() fuck_around vibe_check(rizz ratios vibe) its_giving no_cap; big_yikes its_giving cap; find_out(Tea t) Shoutout.SpillTea(t.Yap); yeet; Fear the phantom (horror game) @Phantom_TheGame"
        },
        { 
            "text": "3 spooky 5 me",
            "transcription": "surface web deep web dark web page two of google"
        },
        { 
            "text": "This is literally CSC 231",
            "transcription": "algorithms and data structures professors watching someone loop through a list instead of creating a custom recursive binary heap object to store 7 integers."
        },
        { 
            "text": "Your crush thinks you're a 2 (r.i.p).",
            "transcription": "Your crush knows binary. She thinks you're a 10. She thinks you're a 10."
        }, 
        { 
            "text": "Java is too VERBOSE",
            "transcription": "When I'm in a Being verbose competition and my opponent is the Java programming language"
        },
        { 
            "text": "So Real",
            "transcription": "When you come back from a vacation HelloWorld(\"print\")"
        },
        { 
            "text": "CSC 351 Gang",
            "transcription": "Hi, this is your son's school. We're having some computer trouble. Oh, dear - did he break something? In a way - Did you really name your son Robert'); DROP TABLE Students;--? Oh, yes. Little Bobby Tables, we call him. Well, we've lost this year's student records. I hope you're happy. And I hope you've learned to sanitize your database inputs."
        },
        { 
            "text": "Lenovo's Interview Process ",
            "transcription": "Send a cv get rejected send a cv interview with Hr interview with developers technical interview get rejected"
        },
        { 
            "text": "They're even now. (This isn't about me. I don't lie on my resume, I just thought it was funny)",
            "transcription": "Me who lied on my resume my new employer who lied on the job description"
        }, 
        { 
            "text": "Computer science student vs Earth",
            "transcription": "Javascript developer position open Nice! Not the best salary but...think I will apply See how you compare to the other 1,146 applicants."
        },
        { 
            "text": "CSC 302 Flashbacks (Tower of Hanoi)",
            "transcription": "Everyone: it's a game for kids. Programmers: "
        },
        { 
            "text": "Light mode users be like",
            "transcription": "Blind Myself With a Lamp For No Reason!!"
        },
        {
            "text": "I fear no man, but that THING...it scares me.",
            "transcription": "Programmers who use light themed IDE Satan"
        },
        {
            "text": "\"Freethinkers\" when Youtube Algorithm",
            "transcription": "Dudes be like \"I don't watch TV, I'm not gonna let the mainstream media tell me how to think\". My brother in christ you let recommendation_watchnext.serve() determine your whole personality."
        },
        {
            "text": "print(\"yeet\")",
            "transcription": "powerful and advanced debugging tools print(\"test\")"
        },
        {
            "text": "The NSA application process be like",
            "transcription": "When you applied for the job. When you hear back from the recruiter."
        },
        {
            "text": "It's like VSCode on Steroids",
            "transcription": "Plain VSCode. VSCode with extensions."
        },
        {
            "text": "He kinda gave us NullPointerException's tho 😍",
            "transcription": "To the programmer who invented null: Thanks for nothing."
        },
        {
            "text": "Friendliest Programmer/Tester Interaction",
            "transcription": "Doctor and nurse Programmer and Tester"
        },
        {
            "text": "He kinda gave us NullPointerException's tho 😍",
            "transcription": "To the programmer who invented null: Thanks for nothing."
        },
        {
            "text": "Friendliest Programmer/Tester Interaction",
            "transcription": "Doctor and nurse Programmer and Tester"
        },
        {
            "text": "\"Can you fix my printer?\" energy",
            "transcription": "Money Status Using The Terminal In Front Of Non-Programmers"
        },
        {
            "text": "I am a Good Programming 😎",
            "transcription": "Not Sure If I Am a Good Programming Or Good at Googling"
        },
        {
            "text": "I was praying for this like everyday back in 2021",
            "transcription": "When someone mentions the possibility of college being canceled due to coronavirus. Don't do that, don't give me hope."
        },
        {
            "text": "Alarmy be like",
            "transcription": "Companies when their UI is perfect. Change it for no reason"
        },
        {
            "text": "Do you have any idea how lit this would be",
            "transcription": "The world if you could use the command line to update pom.xml dependencies"
        },
        {
            "text": "This is actually pretty helpful",
            "transcription": "LEFT JOIN RIGHT JOIN INNER JOIN FULL OUTER JOIN"
        },
        {
            "text": "CSC 133 Gang",
            "transcription": "Fun with flags norway xorway xnorway andway nandway notway"
        },
        {
            "text": "Random 2020 throwback meme for good measure",
            "transcription": "I'm pretty sure i pretty sure I had coronavirus in December 2019 cause like i had a real bad cold but they said wasn't the flu so idk"
        },
        {
            "text": "Job Searching in 2024 be like",
            "transcription": "I want to do an internship do you have experience? I want to gain experience in the internship anyway here's your rejection"
        },
        {
            "text": "Relatable",
            "transcription": "Fourth graders using CHAT-GPT to do their \"List 5 uses of water\" homework"
        },
        {
            "text": "Code repositories at work be like",
            "transcription": "In terms of documentation we have no documentation"
        }
    ]
}