{
    "Home": [
        {
            "Header": "What is this website?",
            "Body": "The main purpose of this website is to help you start your software engineering career. We're going to get you an internship, we're going to get you a job, and we're going to get you PAID. I understand that the current job market is difficult to get into, not just for UNCW students, but for computer science majors as a whole. This site contains information that will help you in your job search and in your academic career. I also included some other more general topics throughout the website that I thought you might like. If you want me to add a section or want me to elaborate or add more information to an existing section, please don't hesitate to (Contact me)[/ContactMe]."
        },
        {
            "Header": "Why should you listen to me?",
            "Body": "I am a recent UNCW computer science alumni and I'm currently working as a Software Engineer at IBM in Research Triangle Park. During college I had two SWE internships, one at USAA and the other at a startup company called Amotions, Inc. I've also received a couple other full-time and internship offers as well. My situation is somewhat rare for a UNCW alumni and I want to help get you in the same boat, if that's something you're interested in. So far, I've successfully helped a friend of mine at UNCW (class of 2025) get a SWE internship at USAA and I feel like I've developed pretty good job-searching strategies over the years. I think you would find some of these techniques and strategies useful, so I've shared them fairly in depth throughout this website. As mentioned earlier, if you need any help with anything please do not hesitate to (contact me)[/ContactMe]. Definitely don't hesitate to spam me with questions, I'd be more than happy to answer all of them to the best of my ability."
        },
        {
            "Header": "Explanation of Search Functionality",
            "Body": "You can search for a page by typing it's name in the search bar. The results shown are pages that's name matches the search query. If you want to search for a term within a page, type the term in the search bar and then click return/enter. You'll be taken to a page showing views which contain the search term. You can't be hovering over the search bar when you press enter/return to avoid a menu accidentally expanding. Just move your cursor to the side when you start typing. This isn't an issue when the sidebar is displayed."
        },
        {
            "Header": "Download or View Source Code",
            "Body": "You can view the source code in this [GitHub Repository](https://github.com/MichaelW-23/ForGuy). This web application is written in Vue.js and is currently being hosted on GitHub pages. In case something happens to this website, you can also download the source code by clicking &here&(/download/Practice.docx)."
        }
    ]
}